/*
Съставете програма с функция за въвеждане на реално число.
Функцията не връща стойност.Функцията приема като входен параметър
адреса на променлива от реален тип данни.На подадената променлива като
входен параметър се присвоява реално число, въведено от клавиатурата.
Main функцията дефинира променлива от реален тип с начална стойност 0,
извежда стойността на променливата преди и след извикването на функцията
*/

#include <iostream>
using namespace std;

void enter(double& number);

int main()
{
	double x = 0;

	cout << "Start value of x: " << x << endl;

	enter(x);

	cout << "New value of x: " << x << endl;
}

void enter(double& number) 
{
	cout << "Enter number: ";
	cin >> number;
}
