#include <iostream>

using namespace std;

int units(int val);
int tens(int val);
int hundreds(int val);

int main()
{
	int a(837);
	cout << " - Homework N2, Ex 4 - \n\n"
		<<"Separate 837 into U, T & H:\n"
		<< "Units: " << units(a)
		<< " | Tens: " << tens(a)
		<< " | Hundreds: "<< hundreds(a)<<endl;
}

int units(int val)
{
	return val % 10;
}

int tens(int val)
{
	return (val / 10)%10;
}

int hundreds(int val)
{
	return val / 10 / 10;
}

// Съставете програма с функции за :
//	- Извличане на единиците от 3 цифрено число.Приема като параметър цяло 
//		число и връща като резултат цифрата на единиците му.
//	- Извеждане на десетиците от 3 цифрено число.Приема като параметър цяло 
//		число и връща като резултат цифрата на десетиците му.
//	- Извеждане на стотиците от 3 цифрено число.Приема като параметър цяло 
//		число и връща като резултат цифрата на стотиците му.
// Във функция main се дефинира числото 837 и се извеждат на три отделни реда 
// цифрите на единиците, стотиците и десетиците му като се използват функциите.