#include <iostream>

using namespace std;

void main()
{
	int a, b;
	float c, d;
	cout << " - Homework N1, Ex 1 - \n\n"
		<< "Entering values:\n"
		<< "A=";
	cin >> a;
	cout << "B=";
	cin >> b;
	c = a / b; //На променливата се присвоява резултат, който е цяло число
	//Това е така, защото извършваме операция с променливи, чийто тип е целочислен.
	//Което означава, че след извършената операция, резултатът също следва да е цяло число.
	d = (float)a / b; //На променливата се присвоява резултат, който е число с плаваща запетая.
	//Това е така, защото извършваме преобразуване на стойността на поне една от целочислените
	//променливи, участващи в действието.
	cout << "\n\nResults:\n"
		<< "C=" << c << endl
		<< "D=" << d << endl;
	system("pause");
}

//Съставете програма в която да се въвеждат две целочислени числа А и B :
//а) На променлива С с плаваща запетая присвоете резултата от делението на А и В.Изведете резултата.
//б) На променлива D с плаваща запетая присвоете резултата от делението на А и В като конвертирате А във float.Изведете резултата.
//c) Като коментар в програмата обяснете резултатите от а) и б).