#include <iostream>

using namespace std;

int main()
{
    int A, B;

    cout << "A=";
    cin >> A;
    cout << "B=";
    cin >> B;
    float C=A/B;
    cout << "C=" << C << endl;//Когато А и В са декларирани като цели числа, дори при делението да се получи дробно число, ще се изведе като цяло число, закръглено към по най-близкото по-малко цяло число.

    float D = (float)A/B;
    cout << "D=" << D << endl;//Като А или B и D са числа с плаваща запетая се извежда число с плаваща запетая.

    return 0;
}
