#include <iostream>
using namespace std;

int main() {
	double a; //Променлива 'а' без числова стойност. Данната е от тип "double", защото може да се въведе число с плаваща запетая.
	double b; //Променлива 'b' без числова стойност. Данната е от тип "double", защото може да се въведе число с плаваща запетая.
	double c; //Променлива 'c' без числова стойност. Данната е от тип "double", защото може да се въведе число с плаваща запетая.
	double d; //Променлива 'd' без числова стойност. Данната е от тип "double", защото може да се извъведе число с плаваща запетая.

	cout << "a= "; // От конзолата се извежда стринга "a=", като индикатор за програмиста да въведе стойност за 'а'
	cin >> a; // Тук се въвежда в конзолата стойността на 'а'
	cout << "b= "; // От конзолата се извежда стринга "b=", като индикатор за програмиста да въведе стойност за 'b'
	cin >> b; // Тук се въвежда в конзолата стойността на 'b'
	cout << "c= "; // От конзолата се извежда стринга "c=", като индикатор за програмиста да въведе стойност за 'c'
	cin >> c; // Тук се въвежда в конзолата стойността на 'c'

	d = double((a + b + c) / 3); //Извършва се средно аритметично между стойностите на променливите 'а','b' и 'с'. (тип "double", защото може да се получи число с плаваща запетая) След това стойността се присвоява от променливата 'd'.
	cout << "d=" << d << endl; //Извежда се от конзолата стринга "d=" и след това се извежда новата стойност на променливата 'd'
	return 0; //Програмата е завършена и връща резултат
}