#include <iostream>
using namespace std;

int main() {
	float a; //Променливата 'а' без числена стойност. Данната е от тип "float", защотo ще е число с плаваща запетая.
	int b; //Променливата 'b' без числена стойност. Данната е от тип "int", защото ще е число с фиксирана запетая.
	double d; //Променливата 'd' без числена стойност. Данната е от тип "double", защото трябва да се получи число с плаваща запетая.

	cout << "a="; // От конзолата се извежда стринга "a=", като индикатор за програмиста да въведе стойност за 'а'
	cin >> a; // Тук се въвежда в конзолата стойността на 'а'
	cout << "b="; // От конзолата се извежда стринга "b=", като индикатор за програмиста да въведе стойност за 'b'
	cin >> b; // Тук се въвежда в конзолата стойността на 'b'
	d = double(a / b); //Осъществява се делението на променливите 'а' и 'b' и тяхната стойност се присвоява от променливата 'd'
	cout << "d=" << d << endl;  //Извежда се от конзолата стринга "d=", а след това новата стойност на променливата 'd'
	return 0; //Завършва програмата и се връща резултат
}