#include <iostream>
using namespace std;

int main() {
	int a, b; //Променливите 'а' и 'b' без числени стойности. Данните са от тип "int", защото ще се въведат числа с плаваща запетая.
	double c; //Променливата 'с' без числена стойност. Данната е от тип "double", защото трябва да се получи число с плаваща запетая.

	cout << "a="; // От конзолата се извежда стринга "a=", като индикатор за програмиста да въведе стойност за 'а'
	cin >> a; // Тук се въвежда в конзолата стойността на 'а'
	cout << "b="; // От конзолата се извежда стринга "b=", като индикатор за програмиста да въведе стойност за 'b'
	cin >> b; // Тук се въвежда в конзолата стойността на 'b'
	 c= double (a / b); //Осъществява се делението на променливите 'а' и 'b' и тяхната стойност се присвоява от променливата 'с'
	cout << "c=" << c << endl;  //Извежда се от конзолата стринга "с=", а след това новата стойност на променливата 'с'
	return 0; //Завършва програмата и се връща резултат
}