#include <iostream>
#include <math.h>
using namespace std;
int main()
{
	int a, b; // Декларира две цели променливи числа.
	cout << "Въведете стойност за а=" << endl; // Изкарва стойност за а/или текст.
	cin >> a; // Чете стойност за а
	cout << "Въведете стойност за b=" << endl; // Изкарва стойност за b/или текст.
	cin >> b; // Чете стойност за b
	float c = a / b; // Чете стойност за c, със плаваща запетая.
	cout << "Стойността на c=" << c << endl; // Изкарва стойност за c/или текст.
	return 0;










}